/*
*****************************************************************************************
*                                   svpwm驱动模块
*                       包含了PARK, CLARKE变换，PI反馈，SVPWM等算法
*                          huanghuan   2013-05-27 14:38:17
*****************************************************************************************
*/

#ifndef _USERS_SVPWM_H_
#define _USERS_SVPWM_H_

#define		sqrt2				1448			//  Q10
#define		sqrt3				1773  			//  Q10
#define 	sqrt3inv			591				//  Q10

//
//输入参数: u, v, w
//输出参数: alfa, beta
//附注：

/************************************************************************
**函数原型:
**函数名称：CLARKE变换
**函数功能：
**入口参数：a 对应a相值
			
**出口参数：无
**说    明：三相对称，也就是c = -a - b
			简化为alfa = a; 
				  beta = (2 * b + a) / sqrt(3);
**作    者：
**日    期：
*************************************************************************/
#define  	ClarkAlfa(a)	(a)										
#define  	ClarkBeta(a,b)	(((long)(2*b + a) * sqrt3inv)>> 10)
/************************************************************************
**函数原型:
**函数名称：CLARKE逆变换
**函数功能：
**入口参数：
			
**出口参数：无
**说    明：
**作    者：
**日    期：
*************************************************************************/
#define  	ClarkInvA(alfa,beta)	(beta)										
#define  	ClarkInvB(alfa,beta)	(((long)sqrt3 * alfa-(long)beta*1024)>>11)									
#define  	ClarkInvC(alfa,beta)	(((long)-sqrt3 * alfa-(long)beta*1024)>>11)										
/************************************************************************
**函数原型:
**函数名称：Park变换
**函数功能：
**入口参数：alfa, 
			beta, theta的正弦余弦值
			
**出口参数：无
**说    明：
**作    者：
**日    期：
*************************************************************************/
#define		ParkD(alfa,beta)		(((long)beta*sina_theta + (long)alfa*cosa_theta)>>14)
#define		ParkQ(alfa,beta)		(((long)beta*cosa_theta - (long)alfa*sina_theta)>>14)


/************************************************************************
**函数原型:
**函数名称：Park逆变换
**函数功能：
**入口参数：
			
**出口参数：无
**说    明：
**作    者：
**日    期：
*************************************************************************/
#define		ParkInvAlfa(d,q)		(((long)d*cosa_theta - (long)q*sina_theta)>>14) 
#define		ParkInvBeta(d,q)		(((long)d*sina_theta + (long)q*cosa_theta)>>14)

/************************************************************************
**函数原型:
**函数名称：
**函数功能：进行SVPWM运算，并配置PWM寄存器，产生相应的占空比脉冲
**入口参数：
			
**出口参数：无
**说    明：
**作    者：
**日    期：
*************************************************************************/
void svpwm(int vsd, int vsq);




#endif
