//###########################################################################
//
// FILE:   DSP2833x_Config.h
//
// TITLE:  DSP2833x 系统宏、结构体、联合体、枚举类型定义.
//
//###########################################################################
//		V1.0		2016-12-26 09:31:29
//###########################################################################

#ifndef _DSP2833x_CONFIG_H_
#define _DSP2833x_CONFIG_H_
#include "DSP2833x_Device.h"
#include "DSP2833x_Examples.h"

#ifdef __cplusplus
extern "C" {
#endif

/*---------------------------------------------------------------------
函数原型：void DelayUs(volatile int Usec)
函数名称：延时函数
函数功能：
入口参数：延时时间---Usec                  
出口参数：无
作    者：
日    期：
----------------------------------------------------------------------*/
void DelayUs(volatile int Usec);


#ifdef __cplusplus
}
#endif /* extern "C" */

#endif  // end of DSP2833x_DEVICE_H definition


//===========================================================================
// End of file.
//===========================================================================
