#ifndef  _USERS_EPWM_H_
#define  _USERS_EPWM_H_
#include "DSP2833x_Device.h"     
#include "DSP2833x_Examples.h"

#define EPWM_CH1		1
#define EPWM_CH2		2
#define EPWM_CH3		4
//#define EPWM_CH4		4
//#define EPWM_CH5		5
//#define EPWM_CH6		6
#define EPWM_ALL		7

/*---------------------------------------------------------------------
函数原型：void InitEPWM(void)
函数名称：初始化EPWM模块
函数功能：
入口参数：无                    
出口参数：无
作    者：
日    期：
----------------------------------------------------------------------*/
void InitEPWM(void);


/*---------------------------------------------------------------------
函数原型：void EnableTZ(void)
函数名称：使能TZ1
函数功能：
入口参数：无                    
出口参数：无
作    者：
日    期：
----------------------------------------------------------------------*/
void EnableTZ(void);


/*---------------------------------------------------------------------
函数原型：void Disable_TZ(void)
函数名称：禁止TZ1
函数功能：
入口参数：无                    
出口参数：无
作    者：
日    期：
----------------------------------------------------------------------*/
void Disable_TZ(void);

/*---------------------------------------------------------------------
函数原型：void InitEPwm1(int freq)
函数名称：epwm1初始化
函数功能：
入口参数：freq---开关频率                    
出口参数：无
作    者：
日    期：
----------------------------------------------------------------------*/
void InitEPwm1(int freq);

/*---------------------------------------------------------------------
函数原型：void InitEPwm2(int freq)
函数名称：epwm2初始化
函数功能：
入口参数：freq---开关频率                     
出口参数：无
作    者：
日    期：
----------------------------------------------------------------------*/
void InitEPwm2(int freq);

/*---------------------------------------------------------------------
函数原型：void InitEPwm3(int freq)
函名称：epwm3初始化
函数功能：
入口参篺req---开关频率                     
出口参数：无
作    者：
日    期：
----------------------------------------------------------------------*/
void InitEPwm3(int freq);

//设置IGBT4的上下管是GPIO，用来做切换开关；
void InitPWM4(void);

/*---------------------------------------------------------------------
函数原型：void InitEPwm1(int freq)
函数名称：epwm1初始化
函数功能：
入口参数：freq---开关频率                    
出口参数：无
作    者：
日    期：
----------------------------------------------------------------------*/
void InitEPwm56(int freq);

/*---------------------------------------------------------------------
函数原型：void EnablePWM(char channel)
函数名称：打开PWM
函数功能：
入口参数：channel---通道号	1:	A相  
							2:	B相 
							4: 	C相;
							7: 	A,B,C相；
出口参数：无
作    者：
日    期：
----------------------------------------------------------------------*/
void EnablePWM(char channel);

/*---------------------------------------------------------------------
函数原型：void DisablePWM(char channel)
函数名称：设置输出为高电平：就是禁止PWM输出；
函数功能：
入口参数：channel---通道号	1:	A相
							2:	B相 
							4: 	C相;
							7: 	A,B,C相；
出口参数：无
作    者：
日    期：
----------------------------------------------------------------------*/
void DisablePWM(char channel);

/*---------------------------------------------------------------------
函数原型：void InitTzGpio(void)
函数名称：初始化TZ（错误区域信号）
函数功能：硬件故障输入口为GPIO12
入口参数：无
出口参数：无
作    者：
日    期：2014年06月26日
----------------------------------------------------------------------*/
void InitTzGpio(void);
#endif

